DataProcessors/МедицинскоеСтрахование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МедицинскоеСтрахование</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСтрахования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСтрахования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУдержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУдержания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУдержанияМедицинскогоСтрахованияСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удержание</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдерживатьЗаСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдерживатьЗаРодственников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяЧастичноеУдержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЧастичногоУдержания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрикреплениеСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПрикрепления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикреплениеКПрограммамМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрикреплениеКПрограммеСтрахованияОтложено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОткреплениеСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОткрепления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОткрепления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОткреплениеОтПрограммМедицинскогоСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткреплениеОтПрограммыСтрахованияОтложено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзменениеПерсональныхДанныхСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Застрахованный</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Застрахованный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИзменениеОтправленныхДанныхЗастрахованных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИзменениеОтправленныхДанныхЗастрахованных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзмениласьФамилия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзменилосьИмя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзменилосьОтчество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзмениласьДатаРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраховойНомерПФР</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзменилсяСтраховойНомерПФР</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзменилсяПол</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзмениласьСтрана</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПредставление</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Застрахованный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Застрахованный</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Застрахованный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Застрахованный</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/МедицинскоеСтрахование/Forms/ИзменениеОтправленныхДанных/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("СтраховаяКомпания", СтраховаяКомпания);
	Параметры.Свойство("Застрахованный", Застрахованный);
	
	ЗаполнитьИзменившиесяОтправленныеДанные();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИзменившиесяОтправленныеДанные()
	
	ЗаполнитьПерсональныеДанные();
	ЗаполнитьКонтактнуюИнформацию();
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны() Тогда
		ЗаполнитьДополнительныеРеквизитыИСведения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПерсональныеДанные()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	Запрос.УстановитьПараметр("Застрахованный", Застрахованный);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеОтправленныхДанныхЗастрахованных.Организация КАК Организация,
		|	ИзменениеОтправленныхДанныхЗастрахованных.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ИзменениеОтправленныхДанныхЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Пол КАК Пол,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Страна КАК Страна,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументВид КАК ДокументВид,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументСерия КАК ДокументСерия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументНомер КАК ДокументНомер,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Фамилия КАК Фамилия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Имя КАК Имя,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Отчество КАК Отчество
		|ПОМЕСТИТЬ ВТИзменившиесяДанные
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленныхДанныхЗастрахованных КАК ИзменениеОтправленныхДанныхЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленныхДанныхЗастрахованных.Организация = &Организация
		|	И ИзменениеОтправленныхДанныхЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|	И ИзменениеОтправленныхДанныхЗастрахованных.Застрахованный = &Застрахованный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.Пол КАК Пол,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.Страна КАК Страна,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументПредставление КАК ДокументПредставление,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументВид КАК ДокументВид,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументСерия КАК ДокументСерия,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументНомер КАК ДокументНомер,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.Фамилия КАК Фамилия,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.Имя КАК Имя,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.Отчество КАК Отчество
		|ПОМЕСТИТЬ ВТОтправленнаяКИ
		|ИЗ
		|	РегистрСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(
		|			,
		|			Застрахованный = &Застрахованный
		|				И Организация = &Организация
		|				И СтраховаяКомпания = &СтраховаяКомпания) КАК ОтправленныеДанныеЗастрахованныхСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИзменившиесяДанные.ДатаРождения КАК ДатаРождения,
		|	ВТОтправленнаяКИ.ДатаРождения КАК ДатаРожденияДоИзменения,
		|	ВТИзменившиесяДанные.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ВТОтправленнаяКИ.СтраховойНомерПФР КАК СтраховойНомерПФРДоИзменения,
		|	ВТИзменившиесяДанные.Пол КАК Пол,
		|	ВТОтправленнаяКИ.Пол КАК ПолДоИзменения,
		|	ВТИзменившиесяДанные.Страна КАК Страна,
		|	ВТОтправленнаяКИ.Страна КАК СтранаДоИзменения,
		|	ВТИзменившиесяДанные.ДокументВид КАК ДокументВид,
		|	ВТОтправленнаяКИ.ДокументВид КАК ДокументВидДоИзменения,
		|	ВТИзменившиесяДанные.ДокументСерия КАК ДокументСерия,
		|	ВТОтправленнаяКИ.ДокументСерия КАК ДокументСерияДоИзменения,
		|	ВТИзменившиесяДанные.ДокументНомер КАК ДокументНомер,
		|	ВТОтправленнаяКИ.ДокументНомер КАК ДокументНомерДоИзменения,
		|	ВТИзменившиесяДанные.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ВТОтправленнаяКИ.ДокументДатаВыдачи КАК ДокументДатаВыдачиДоИзменения,
		|	ВТИзменившиесяДанные.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ВТОтправленнаяКИ.ДокументСрокДействия КАК ДокументСрокДействияДоИзменения,
		|	ВТИзменившиесяДанные.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ВТОтправленнаяКИ.ДокументКемВыдан КАК ДокументКемВыданДоИзменения,
		|	ВТИзменившиесяДанные.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	ВТОтправленнаяКИ.ДокументКодПодразделения КАК ДокументКодПодразделенияДоИзменения,
		|	ВТИзменившиесяДанные.Фамилия КАК Фамилия,
		|	ВТОтправленнаяКИ.Фамилия КАК ФамилияДоИзменения,
		|	ВТИзменившиесяДанные.Имя КАК Имя,
		|	ВТОтправленнаяКИ.Имя КАК ИмяДоИзменения,
		|	ВТИзменившиесяДанные.Отчество КАК Отчество,
		|	ВТОтправленнаяКИ.Отчество КАК ОтчествоДоИзменения
		|ИЗ
		|	ВТИзменившиесяДанные КАК ВТИзменившиесяДанные,
		|	ВТОтправленнаяКИ КАК ВТОтправленнаяКИ";
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если ЗначениеЗаполнено(Результат.ДатаРождения) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Дата рождения'");
			НоваяСтрока.ОтправленноеЗначение = Формат(Результат.ДатаРожденияДоИзменения, "ДЛФ=Д");
			НоваяСтрока.НовоеЗначение = Формат(Результат.ДатаРождения, "ДЛФ=Д");
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.СтраховойНомерПФР) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'СНИЛС'");
			НоваяСтрока.ОтправленноеЗначение = Результат.СтраховойНомерПФРДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.СтраховойНомерПФР;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.Пол) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Пол'");
			НоваяСтрока.ОтправленноеЗначение = Результат.ПолДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.Пол;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.Страна) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Гражданство'");
			НоваяСтрока.ОтправленноеЗначение = Результат.СтранаДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.Страна;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументСерия) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Серия документа'");
			НоваяСтрока.ОтправленноеЗначение = Результат.ДокументСерияДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.ДокументСерия;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументНомер) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Номер документа'");
			НоваяСтрока.ОтправленноеЗначение = Результат.ДокументНомерДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.ДокументНомер;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументДатаВыдачи) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Дата выдачи документа'");
			НоваяСтрока.ОтправленноеЗначение = Формат(Результат.ДокументДатаВыдачиДоИзменения, "ДЛФ=Д");
			НоваяСтрока.НовоеЗначение =  Формат(Результат.ДокументДатаВыдачи, "ДЛФ=Д");
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументСрокДействия) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Срок действия документа'");
			НоваяСтрока.ОтправленноеЗначение = Результат.ДокументСрокДействияДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.ДокументСрокДействия;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументКемВыдан) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Кем выдан документ'");
			НоваяСтрока.ОтправленноеЗначение = Результат.ДокументКемВыданДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.ДокументКемВыдан;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументКодПодразделения) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Код подразделения документа'");
			НоваяСтрока.ОтправленноеЗначение = Результат.ДокументКодПодразделенияДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.ДокументКодПодразделения;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.Фамилия) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Фамилия'");
			НоваяСтрока.ОтправленноеЗначение = Результат.ФамилияДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.Фамилия;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.Имя) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Имя'");
			НоваяСтрока.ОтправленноеЗначение = Результат.ИмяДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.Имя;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.Отчество) Тогда
			НоваяСтрока = ИзменившиесяДанные.Добавить();
			НоваяСтрока.Имя = НСтр("ru = 'Отчество'");
			НоваяСтрока.ОтправленноеЗначение = Результат.ОтчествоДоИзменения;
			НоваяСтрока.НовоеЗначение = Результат.Отчество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактнуюИнформацию()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	Запрос.УстановитьПараметр("Застрахованный", Застрахованный);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Организация КАК Организация,
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Вид КАК Вид,
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Представление КАК Представление
		|ПОМЕСТИТЬ ВТИзменившаясяКИ
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных КАК ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Организация = &Организация
		|	И ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|	И ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Застрахованный = &Застрахованный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Организация КАК Организация,
		|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Застрахованный КАК Застрахованный,
		|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Вид КАК Вид,
		|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Представление КАК Представление
		|ПОМЕСТИТЬ ВТОтправленнаяКИ
		|ИЗ
		|	РегистрСведений.ОтправленнаяКонтактнаяИнформацияЗастрахованных.СрезПоследних(
		|			,
		|			Застрахованный = &Застрахованный
		|				И Организация = &Организация
		|				И СтраховаяКомпания = &СтраховаяКомпания) КАК ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИзменившаясяКИ.Вид КАК Имя,
		|	ВТИзменившаясяКИ.Представление КАК НовоеЗначение,
		|	ВТОтправленнаяКИ.Представление КАК ОтправленноеЗначение
		|ИЗ
		|	ВТИзменившаясяКИ КАК ВТИзменившаясяКИ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтправленнаяКИ КАК ВТОтправленнаяКИ
		|		ПО ВТИзменившаясяКИ.Организация = ВТОтправленнаяКИ.Организация
		|			И ВТИзменившаясяКИ.СтраховаяКомпания = ВТОтправленнаяКИ.СтраховаяКомпания
		|			И ВТИзменившаясяКИ.Застрахованный = ВТОтправленнаяКИ.Застрахованный
		|			И ВТИзменившаясяКИ.Вид = ВТОтправленнаяКИ.Вид";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		НоваяСтрока = ИзменившиесяДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыИСведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	Запрос.УстановитьПараметр("Застрахованный", Застрахованный);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Организация КАК Организация,
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Свойство КАК Свойство,
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Значение КАК Значение
		|ПОМЕСТИТЬ ВТИзменившеисяСвойства
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных КАК ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Организация = &Организация
		|	И ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|	И ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Застрахованный = &Застрахованный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованныхСрезПоследних.Организация КАК Организация,
		|	ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованныхСрезПоследних.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованныхСрезПоследних.Застрахованный КАК Застрахованный,
		|	ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованныхСрезПоследних.Свойство КАК Свойство,
		|	ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованныхСрезПоследних.Значение КАК Значение
		|ПОМЕСТИТЬ ВТОтправленныеСвойства
		|ИЗ
		|	РегистрСведений.ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных.СрезПоследних(
		|			,
		|			Застрахованный = &Застрахованный
		|				И Организация = &Организация
		|				И СтраховаяКомпания = &СтраховаяКомпания) КАК ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованныхСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИзменившеисяСвойства.Свойство КАК Имя,
		|	ВТИзменившеисяСвойства.Значение КАК НовоеЗначение,
		|	ВТОтправленныеСвойства.Значение КАК ОтправленноеЗначение
		|ИЗ
		|	ВТИзменившеисяСвойства КАК ВТИзменившеисяСвойства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтправленныеСвойства КАК ВТОтправленныеСвойства
		|		ПО ВТИзменившеисяСвойства.Организация = ВТОтправленныеСвойства.Организация
		|			И ВТИзменившеисяСвойства.СтраховаяКомпания = ВТОтправленныеСвойства.СтраховаяКомпания
		|			И ВТИзменившеисяСвойства.Застрахованный = ВТОтправленныеСвойства.Застрахованный
		|			И ВТИзменившеисяСвойства.Свойство = ВТОтправленныеСвойства.Свойство";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		НоваяСтрока = ИзменившиесяДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
